Tekla Open API Reference for Tekla Structures 2025
Localization.Localize Method
Overload List
Name | Description
Localize(ApplicationSettingsBase)
 Localizes application settings.
Localize(Control)
 Localizes a control recursively.
Localize(MenuItem)
 Localizes a MenuItem control recursively.
Top
See Also
Reference
Localization Class
Tekla.Structures.Dialog Namespace